In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('Online Sales Data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [3]:
df.shape

(240, 9)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    240 non-null    int64
 1   Date              240 non-null    object
 2   Product Category  240 non-null    object
 3   Product Name      240 non-null    object
 4   Units Sold        240 non-null    int64
 5   Unit Price        240 non-null    float64
 6   Total Revenue     240 non-null    float64
 7   Region            240 non-null    object
 8   Payment Method    240 non-null    object
dtypes: float64(2), int64(2), object(5)
memory usage: 17.0+ KB

In [5]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000

In [6]:
# Convert date to datetime
df['Date'] = pd.to_datetime(df['Date'])

In [7]:
# Check for null values
print(df.isnull().sum())

Transaction ID      0
Date                0
Product Category    0
Product Name        0
Units Sold          0
Unit Price          0
Total Revenue       0
Region              0
Payment Method      0
dtype: int64

In [8]:
#Ensuring correct data types
df['Units Sold'] = df['Units Sold'].astype(int)
df['Unit Price'] = df['Unit Price'].astype(float)
df['Total Revenue'] = df['Total Revenue'].astype(float)

In [9]:
#Check for duplicate rows
print(f'Duplicate rows: {df.duplicated().sum()}')
df = df.drop_duplicates()

Duplicate rows: 0

In [10]:
#Summary Statistics
df.describe(include='all')

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
count,240.00000,240,240,240,240.000000,240.000000,240.000000,240,240
unique,NaN,NaN,6,232,NaN,NaN,NaN,3,3
top,NaN,NaN,Electronics,Dyson Supersonic Hair Dryer,NaN,NaN,NaN,North America,Credit Card
freq,NaN,NaN,40,2,NaN,NaN,NaN,80,120
mean,10120.50000,2024-04-29 12:00:00,NaN,NaN,2.158333,236.395583,335.699375,NaN,NaN
min,10001.00000,2024-01-01 00:00:00,NaN,NaN,1.000000,6.500000,6.500000,NaN,NaN
25%,10060.75000,2024-02-29 18:00:00,NaN,NaN,1.000000,29.500000,62.965000,NaN,NaN
50%,10120.50000,2024-04-29 12:00:00,NaN,NaN,2.000000,89.990000,179.970000,NaN,NaN
75%,10180.25000,2024-06-28 06:00:00,NaN,NaN,3.000000,249.990000,399.225000,NaN,NaN
max,10240.00000,2024-08-27 00:00:00,NaN,NaN,10.000000,3899.990000,3899.990000,NaN,NaN
std,69.42622,NaN,NaN,NaN,1.322454,429.446695,485.804469,NaN,NaN

In [14]:
#Sales Trends Over Time
sales_trends = df.groupby('Date')['Total Revenue'].sum().reset_index
sales_trends

<bound method Series.reset_index of Date
2024-01-01    1999.98
2024-01-02     499.99
2024-01-03     209.97
2024-01-04      63.96
2024-01-05      89.99
               ...
2024-08-23     159.99
2024-08-24     270.00
2024-08-25      32.97
2024-08-26      55.00
2024-08-27      59.98
Name: Total Revenue, Length: 240, dtype: float64>

In [12]:
import matplotlib.pyplot as plt
import seaborn as sns

In [13]:
plt.figure(figsize=(12, 6))
plt.plot(sales_trends['Date'], sales_trends['Total Revenue'], marker='o')
plt.title('Sales Trends Over Time')
plt.xlabel('Date')
plt.ylabel('Total Revenue')
plt.show()

TypeError: 'method' object is not subscriptable